In [1]:
import pandas
import pandas as pd

In [2]:
collegemates={"name":("hari","harsha","vamsi","varun"),
             "quality":("intelligent","irritating","anxious","talented")}

In [3]:
dfc=pd.DataFrame(collegemates)
dfc

     name      quality
0    hari  intelligent
1  harsha   irritating
2   vamsi      anxious
3   varun     talented

In [4]:
colleagus={"name":("shabana","anusha","parvin","nasheena"),
          "quality":("good","arrogant","talent","intelligent")}

In [5]:
dfco=pd.DataFrame(colleagus)
dfco

       name      quality
0   shabana         good
1    anusha     arrogant
2    parvin       talent
3  nasheena  intelligent

In [6]:
dfc.groupby("quality")["name"].count()

quality
anxious        1
intelligent    1
irritating     1
talented       1
Name: name, dtype: int64

In [7]:
dfco.groupby("quality")["name"].count()

quality
arrogant       1
good           1
intelligent    1
talent         1
Name: name, dtype: int64

In [8]:
boysfriends=pd.read_excel(r"E:\Santhosh\Pandas_assign13\boys_friends.xlsx")
boysfriends

    name      quality
0   hari  intelligent
1  varun   irritating
2  varun      anxious
3  vamsi     talented

In [9]:
boysfriends.groupby("name")["quality"].count()

name
hari     1
vamsi    1
varun    2
Name: quality, dtype: int64

In [10]:
girlsfriends=pd.read_excel(r"E:\Santhosh\Pandas_assign13\girls_friends.xlsx")
girlsfriends

       name      quality
0   lavanya  intelligent
1   supraja   irritating
2  prasanna       strong
3  bhargavi       topper

In [11]:
girlsfriends.groupby("quality")["name"].count()

quality
intelligent    1
irritating     1
strong         1
topper         1
Name: name, dtype: int64

In [12]:
chicken_items={"foodname":("chicken_khabab","chicken_dhum","chicken_roast","chicken_65","chicken_fry"),
              "taste":("good","tasty","spicy","spicy","tasty")}

In [13]:
dfchick=pd.DataFrame(chicken_items)
dfchick

         foodname  taste
0  chicken_khabab   good
1    chicken_dhum  tasty
2   chicken_roast  spicy
3      chicken_65  spicy
4     chicken_fry  tasty

In [14]:
mutton_items={"foodname":("mutton_khabab","mutton_dhum","mutton_roast","mutton_kheema","mutton_fry"),
             "taste":("good","tasty","spicy","spicy","tasty")}

In [15]:
dfmutton=pd.DataFrame(mutton_items)
dfmutton

        foodname  taste
0  mutton_khabab   good
1    mutton_dhum  tasty
2   mutton_roast  spicy
3  mutton_kheema  spicy
4     mutton_fry  tasty

In [16]:
dfcm=dfchick.merge(dfmutton,on="taste",how="outer")
dfcm

       foodname_x  taste     foodname_y
0  chicken_khabab   good  mutton_khabab
1    chicken_dhum  tasty    mutton_dhum
2    chicken_dhum  tasty     mutton_fry
3     chicken_fry  tasty    mutton_dhum
4     chicken_fry  tasty     mutton_fry
5   chicken_roast  spicy   mutton_roast
6   chicken_roast  spicy  mutton_kheema
7      chicken_65  spicy   mutton_roast
8      chicken_65  spicy  mutton_kheema

In [17]:
dfcm.groupby("taste")["foodname_y"].count()

taste
good     1
spicy    4
tasty    4
Name: foodname_y, dtype: int64

In [18]:
dfmutton.groupby("foodname")["taste"].count()

foodname
mutton_dhum      1
mutton_fry       1
mutton_khabab    1
mutton_kheema    1
mutton_roast     1
Name: taste, dtype: int64